tap "neurosnap/tap"
brew "asciinema"
brew "bat", args: ["HEAD"]
brew "curl"
brew "direnv", args: ["HEAD"]
brew "eza", args: ["HEAD"]
brew "fish"
brew "fisher"
brew "git-interactive-rebase-tool"
brew "git-spice"
brew "hysteria", restart_service: :changed
brew "micro", args: ["HEAD"]
brew "ntfy"
brew "prek"
brew "rustnet"
brew "starship"
brew "uv"
brew "vivid"
brew "xxhash"
brew "neurosnap/tap/zmx", trusted: true
