tap "domt4/autoupdate", trusted: { commands: ["autoupdate"] }
tap "neurosnap/tap"
tap "oven-sh/bun"
brew "asciinema"
brew "bash"
brew "bat", args: ["HEAD"]
brew "btop"
brew "bttf"
brew "csvlens"
brew "zstd"
brew "curl"
brew "diffoscope"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "git-spice"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "hexyl"
brew "hwatch"
brew "hysteria"
brew "jq"
brew "less"
brew "magic-wormhole"
brew "mas"
brew "mergiraf"
brew "micro"
brew "moreutils"
brew "ntfy"
brew "openssh"
brew "oxipng"
brew "prek"
brew "prettier"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "rustnet"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "starship"
brew "tofrodos"
brew "ttl"
brew "unar"
brew "uutils-coreutils"
brew "uv"
brew "vivid"
brew "watchexec"
brew "xh"
brew "xray"
brew "yt-dlp"
brew "zoxide"
brew "neurosnap/tap/zmx", trusted: true
brew "oven-sh/bun/bun", trusted: true
cask "1password"
cask "aldente"
cask "alt-tab"
cask "android-platform-tools"
cask "apparency"
cask "discord"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "iina"
cask "istat-menus"
cask "linearmouse"
cask "loop"
cask "openmtp"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "spotify"
cask "syntax-highlight"
cask "transmission"
cask "yubico-authenticator"
cask "zed"
mas "Command X", id: 6448461551
mas "Shareful", id: 1522267256
mas "WireGuard", id: 1451685025
