tap "domt4/autoupdate"
tap "homebrew/bundle"
tap "indirect/tap"
tap "nrlquaker/createzap"
tap "oven-sh/bun"
brew "asciinema"
brew "basedpyright"
brew "bat", args: ["HEAD"]
brew "croc"
brew "ctags"
brew "curl"
brew "deno"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-units"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "htop"
brew "hwatch"
brew "jq"
brew "less"
brew "make"
brew "mas"
brew "micro"
brew "moreutils"
brew "nano"
brew "nanorc"
brew "openssh"
brew "p7zip"
brew "pre-commit"
brew "pv"
brew "python@3.13"
brew "ripgrep"
brew "starship"
brew "unar"
brew "uutils-coreutils"
brew "uv"
brew "vivid"
brew "wget2"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "1password"
cask "aldente"
cask "android-platform-tools"
cask "balenaetcher"
cask "cloudflare-warp"
cask "discord"
cask "font-monaspace-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "mos"
cask "obsidian"
cask "openmtp"
cask "protonvpn"
cask "qlvideo"
cask "rectangle"
cask "secretive"
cask "shottr"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "zed"
mas "Command X", id: 6448461551
vscode "bmalehorn.vscode-fish"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "detachhead.basedpyright"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pepri.subtitles-editor"
vscode "redhat.vscode-yaml"
vscode "standard.vscode-standard"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
