tap "domt4/autoupdate"
tap "neurosnap/tap"
tap "sheeki03/tap"
brew "asciinema"
brew "bash"
brew "bat"
brew "btop"
brew "croc"
brew "csvlens"
brew "curl"
brew "deno"
brew "diffoscope"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "git-spice"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-units"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "hexyl"
brew "hwatch"
brew "jq"
brew "less"
brew "mas"
brew "mergiraf"
brew "micro"
brew "moreutils"
brew "openssh"
brew "prek"
brew "prettier"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "screen"
brew "sevenzip"
brew "showkey"
brew "starship"
brew "tofrodos"
brew "unar"
brew "uutils-coreutils"
brew "uv"
brew "vivid"
brew "watch"
brew "watchexec"
brew "wget2"
brew "xh"
brew "yt-dlp"
brew "zoxide"
brew "neurosnap/tap/zmx"
brew "sheeki03/tap/tirith"
cask "1password"
cask "aldente"
cask "alt-tab"
cask "android-platform-tools"
cask "discord"
cask "font-monaspice-nerd-font"
cask "ghostty@tip"
cask "google-chrome"
cask "helium-browser"
cask "iina"
cask "istat-menus"
cask "lantern"
cask "loop"
cask "mac-mouse-fix"
cask "openmtp"
cask "qlmarkdown"
cask "qlvideo"
cask "raycast"
cask "secretive"
cask "shottr"
cask "spotify"
cask "syntax-highlight"
cask "transmission"
cask "zed"
mas "Command X", id: 6448461551
mas "Shareful", id: 1522267256
